spp901780/ElecPartsM_Embedded/.pack/Keil/STM32F0xx_DFP.2.1.0/MDK/Boards/ST/STM32072B-EVAL/Common/GLCD_SPI_STM32072B-EVAL.c
/*-----------------------------------------------------------------------------
 * Name:    GLCD_SPI_STM32072B-EVAL.c
 * Purpose: Graphic LCD interface (240x320 pixels) for Graphic LCD with
 *          SPI interface for STM32072B-EVAL evaluation board
 * Rev.:    1.0.0
 *----------------------------------------------------------------------------*/

/* Copyright (c) 2013 - 2017 ARM LIMITED

   All rights reserved.
   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:
   - Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.
   - Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in the
     documentation and/or other materials provided with the distribution.
   - Neither the name of ARM nor the names of its contributors may be used
     to endorse or promote products derived from this software without
     specific prior written permission.
   *
   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
   AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDERS AND CONTRIBUTORS BE
   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
   SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
   INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
   CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
   ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
   POSSIBILITY OF SUCH DAMAGE.
   ---------------------------------------------------------------------------*/

/*! \page stm32072b_eval_spi_glcd GLCD BSI Setup

The BSI GLCD requires:
  - Configuration of SPI1 peripheral in Asynchronous mode \ref stm32f0_spi
  - Setup of GPIO pins
 
Pinout tab
----------
  1. Click on <b>PE6</b> pin and select <b>GPIO_Output</b> function
  2. Click on <b>PB2</b> pin and select <b>GPIO_Output</b> function
*/


#include <stddef.h>
#include "stm32f0xx.h"                  // Device header
#include "Board_GLCD.h"                 // ::Board Support:Graphic LCD
#include "GLCD_Config.h"                // Keil.STM32072B-EVAL::Board Support:Graphic LCD

#include "Driver_SPI.h"
#include "stm32f0xx_hal.h"

#include "MX_Device.h"

/* ------------------------------- Configuration ---------------------------- */
/* SPI Interface: SPI1
   PINS:
   - CS     = PE6  (GPIO pin)
   - RS     = GND
   - WR/SCK = PB3  (SPI1_SCK)
   - RD     = GND
   - SDO    = PE14 (SPI1_MISO)
   - SDI    = PE15 (SPI1_MOSI)                                                */

#ifndef MX_SPI1
  #error "::Device:STM32Cube Framework (API): STM32CubeMX: Enable SPI1!"
#endif
#ifndef MX_PE6_Pin
  #error "::Device:STM32Cube Framework (API): STM32CubeMX: Set pin PE6 to GPIO_Output function!"
#endif
#ifndef MX_PB2_Pin
  #error "::Device:STM32Cube Framework (API): STM32CubeMX: Set pin PB2 to GPIO_Output function!"
#endif
/* -------------------------------------------------------------------------- */

/* SPI Driver */
extern ARM_DRIVER_SPI         Driver_SPI1;
#define ptrSPI              (&Driver_SPI1)

#define LCD_CS(x)   HAL_GPIO_WritePin(GPIOE, GPIO_PIN_6,  x)
#define LCD_CLK(x)  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3,  x)

#define SPI_START   (0x70)              /* Start byte for SPI transfer        */
#define SPI_RD      (0x01)              /* WR bit 1 within start              */
#define SPI_WR      (0x00)              /* WR bit 0 within start              */
#define SPI_DATA    (0x02)              /* RS bit 1 within start byte         */
#define SPI_INDEX   (0x00)              /* RS bit 0 within start byte         */

#define MODE_IN      0x00
#define MODE_OUT     0x01

/************************ Global variables ************************************/

static uint16_t   foreground_color = GLCD_COLOR_BLACK;
static uint16_t   background_color = GLCD_COLOR_WHITE;
static GLCD_FONT *active_font      = NULL;
static uint8_t    Himax;
#if (GLCD_SWAP_XY == 0)
static uint32_t   Scroll;
#endif

/************************ Local auxiliary functions ***************************/

/**
  \fn          void delay_ms (uint32_t cnt)
  \brief       Delay in while loop cycles
  \param[in]   cnt   number of while cycles to delay
*/    
static void delay_ms (uint32_t cnt) {
  
  for (cnt = (SystemCoreClock >> 14U) * cnt; cnt > 0U; cnt--) {
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP();
    __NOP(); __NOP(); __NOP(); __NOP(); __NOP(); __NOP();
  }
}

/**
  \fn          uint8_t spi_tran_man (uint8_t byte, uint32_t mode)
  \brief       Transfer 1 byte over the serial communication
  \param[in]   byte   byte to be sent
  \param[in]   mode   OUT = transmit byte, IN = receive byte
  \returns     byte read while sending
*/
static uint8_t spi_tran_man (uint8_t byte, uint32_t mode) {
  uint8_t val = 0U;
  int32_t i;
  GPIO_InitTypeDef GPIO_InitStruct;

  if (mode == MODE_OUT) {
    GPIO_InitStruct.Pin  = GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  } else {
    GPIO_InitStruct.Pin  = GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  }
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  if (mode == MODE_OUT) {
    HAL_GPIO_WritePin (GPIOB, GPIO_PIN_2, GPIO_PIN_SET);
  } else {
    HAL_GPIO_WritePin (GPIOB, GPIO_PIN_2, GPIO_PIN_RESET);
  }

  for (i = 7; i >= 0; i--) {
    LCD_CLK(GPIO_PIN_RESET);
    delay_ms(1);
    if (mode == MODE_OUT) {
      HAL_GPIO_WritePin (GPIOE, GPIO_PIN_15, (GPIO_PinState)((byte >> i) & 1));
    } else {
      val |= (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_15) << i);
    }
    LCD_CLK(GPIO_PIN_SET);
    delay_ms(1);
  }

  return (val);
}

/**
  \fn          uint8_t spi_tran (uint8_t byte)
  \brief       Transfer single byte over SPI
  \param[in]   byte  data to send
  \returns     data read
*/
static uint8_t spi_tran (uint8_t byte) {
  uint8_t rcv;

  ptrSPI->Transfer(&byte, &rcv, 1);
  while (ptrSPI->GetStatus().busy);
  return (rcv);
}

/**
  \fn          void wr_cmd (uint8_t cmd)
  \brief       Write a command to the LCD controller
  \param[in]   cmd  Command to write
*/
static void wr_cmd (uint8_t cmd) {
  uint8_t wr_data[3];

  LCD_CS(GPIO_PIN_RESET);
  wr_data[0] = SPI_START | SPI_WR | SPI_INDEX;  /* Write : RS = 0, RW = 0     */
  wr_data[1] = 0;
  wr_data[2] = cmd;
  ptrSPI->Send(wr_data, 3);
  while (ptrSPI->GetStatus().busy);
  LCD_CS(GPIO_PIN_SET);
}

/**
  \fn          void wr_dat (uint16_t dat)
  \brief       Write data to the LCD controller
  \param[in]   dat  Data to write
*/
static void wr_dat (uint16_t dat) {
  uint8_t wr_data[3];

  LCD_CS(GPIO_PIN_RESET);
  wr_data[0] = SPI_START | SPI_WR | SPI_DATA;   /* Write : RS = 1, RW = 0     */
  wr_data[1] = (dat >>   8);
  wr_data[2] = (dat & 0xFF);
  ptrSPI->Send(wr_data, 3);
  while (ptrSPI->GetStatus().busy);
  LCD_CS(GPIO_PIN_SET);
}

/**
  \fn          void wr_dat_start (void)
  \brief       Start writing data to the LCD controller
*/
static void wr_dat_start (void) {
  LCD_CS(GPIO_PIN_RESET);
  spi_tran(SPI_START | SPI_WR | SPI_DATA);    /* Write : RS = 1, RW = 0       */
}

/**
  \fn          void wr_dat_stop (void)
  \brief       Stop writing data to the LCD controller
*/
static void wr_dat_stop (void) {
  LCD_CS(GPIO_PIN_SET);
}

/**
  \fn          void wr_dat_only (uint16_t dat)
  \brief       Write data to the LCD controller (without start/stop sequence)
  \param[in]   dat  Data to write
*/
static void wr_dat_only (uint16_t dat) {
  uint8_t wr_data[2];

  wr_data[0] = (dat >>   8);
  wr_data[1] = (dat & 0xFF);

  ptrSPI->Send(wr_data, 2);
  while (ptrSPI->GetStatus().busy);
}

/**
  \fn          uint16_t rd_dat (void)
  \brief       Read data from the LCD controller
  \returns     Data read
*/
static uint16_t rd_dat (void) {
  uint16_t val = 0;

  LCD_CS(GPIO_PIN_RESET);

